       IDENTIFICATION DIVISION.
       PROGRAM-ID. ABC-COMPANY-SALES-REPORT.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01  REGIONS.
           02 REGION OCCURS 5 TIMES.
              03 SALES OCCURS 3 TIMES PIC 999V99.
       01  SALE.
           02 SALESOUT OCCURS 5 TIMES.
              03 SALES-OUT OCCURS 3 TIMES PIC ZZZ.ZZZ.
       01  TOTSALES.
           02 TOT-SALES OCCURS 5 TIMES PIC 9999V99 VALUE ZERO.
       01  TOTSALES-OUT.
           02 TOT-SALES-OUT OCCURS 5 TIMES PIC ZZZZ.ZZZ.
       01  L PIC 99 VALUE ZERO.
       01  I PIC 9 VALUE ZERO.
       01  J PIC 9 VALUE ZERO.
       
       SCREEN SECTION.
       01  SCRN.
           02 BLANK SCREEN.

       PROCEDURE DIVISION.
           DISPLAY SCRN.
           PERFORM REGION-RTN VARYING I FROM 1 BY 1 UNTIL I > 5
             AFTER J FROM 1 BY 1 UNTIL J > 3.
           DISPLAY SCRN.
           MOVE 3 TO L.
           PERFORM DISPLAY-RTN.
           MOVE 1 TO I.
           MOVE 1 TO J.
           MOVE 9 TO L.
           PERFORM PRINT-RTN VARYING I FROM 1 BY 1 UNTIL I > 5
             AFTER J FROM 1 BY 1 UNTIL J > 3.
           PERFORM FIN-RTN.

       REGION-RTN.
           MOVE 2 TO L.
           DISPLAY "REGION: " LINE L COLUMN 5.
           DISPLAY I LINE L COLUMN 13.
           ADD 1 TO L.
           DISPLAY "ENTER A SALES FOR SALESMAN " LINE L COLUMN 5.
           DISPLAY J LINE L COLUMN 32.
           DISPLAY ": " LINE L COLUMN 33.
           ACCEPT SALES (I, J) LINE L COLUMN 36.
           COMPUTE TOT-SALES(I) = TOT-SALES(I) + SALES(I, J).
           MOVE SALES (I, J) TO SALES-OUT (I, J).
           MOVE TOT-SALES(I) TO TOT-SALES-OUT(I).
           ADD 1 TO L.

       DISPLAY-RTN.
           DISPLAY "ABC COMPANY" LINE 3 COLUMN 35.
           DISPLAY "ORTIGAS AVENUE, PASIG CITY" LINE 4 COLUMN 27.
           DISPLAY "SALES REPORT" LINE 6 COLUMN 35.
           DISPLAY "REGION CODE" LINE 8 COLUMN 4.
           DISPLAY "SALESMAN 1" LINE 8 COLUMN 24.
           DISPLAY "SALESMAN 2" LINE 8 COLUMN 39.
           DISPLAY "SALESMAN 3" LINE 8 COLUMN 54.
           DISPLAY "TOTAL" LINE 8 COLUMN 73.

       PRINT-RTN.
           IF J = 1
             ADD 1 TO L
             DISPLAY I LINE L COLUMN 9
             DISPLAY SALES-OUT (I, J) LINE L COLUMN 26.
           IF J = 2
             DISPLAY SALES-OUT (I, J) LINE L COLUMN 41.
           IF J = 3
             DISPLAY SALES-OUT (I, J) LINE L COLUMN 56.
           DISPLAY TOT-SALES-OUT(I) LINE L COLUMN 71.

       FIN-RTN.
           STOP RUN.
